Autodesk.Revit.DB.Analysis.gbXMLSurfaceType
This enumeration corresponds to the surfaceType attribute in gbXML
and identifies the type of surface defined.
Since:
2012

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.NoOfSurfaceTypes
No of surface types.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.SlabOnGrade
Slab on grade.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.RaisedFloor
Raised floor.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.UndergroundCeiling
Underground ceiling.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.SurfaceAir
Surface air.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.Ceiling
Ceiling.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.UndergroundSlab
Underground slab.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.UndergroundWall
Underground wall.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.Shade
Shade.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.InteriorFloor
Interior floor.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.Roof
Roof.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.ExteriorWall
Exterior wall.

Autodesk.Revit.DB.Analysis.gbXMLSurfaceType.InteriorWall
Interior wall.